#include <iostream> // <- това се нарича "header", защото стои винаги на главата на програмата
					// чрез хедъра най-вече казваме, че кодът в този файл ползва код от друг файл.
					// конкретно iostream ни позволява да ползваме cin и cout

using namespace std; // за това може би ще говорим по-късно по-подробно, но засега ви стига
					 // да знаете, че за да ползвате cout и cin, ще ви трябва. без
					 // този ред, ще трябва да пишете std::cin и std::cout на тяхното място
					 // навсякъде, където се срещат в програмата
/* както казахме програмата трябва да има main функция */
int main() {

	int firstNumber; // дефинираме си променлива, която ще ползваме за първото число

	int secondNumber; // тук дефинираме и втората променлива, за второто число

	cout << "Enter first number: "; // това ще изпише в конзолата това, което е в кавичките
	cin >> firstNumber; // каквото въведе потребителя, ще се опитаме да сложим
						// като стойност на firstNumber
	cout << "Enter second number: ";  // същото като горното
	cin >> secondNumber; 
	if (firstNumber <= secondNumber) /* проверяваме дали първото число е по малко или равно на второто */ { 
		firstNumber *= 3; /* това е просто накратко за firstNumber = firstNumber * 3
							 което прави следното: намира firstNumber * 3 и каквото получи го
							 слага като нова стойност на firstNumber */
		secondNumber /= 5; /* това е накратко за secondNumber = secondNumber / 5 * и
							  работи на абсолютно същия принцип като горното */

		// това се изпълнява ако първото е по-малко или равно на второто
	} else {
		// в противен случай:
		firstNumber /= 5;
		secondNumber *= 3;
	}

	// накрая остана само да върнем резултатите
	cout << "First number: " << firstNumber << endl;
	cout << "Second number: " << secondNumber << endl; // endl - много кратко наименование на 
													   // end line, и прави нов ред

	return 0; // не мислете за това. пишете го в края на main едва след всичко
			  // което сте написали. ще обясним какво е и защо е 
			  // след лекцията ви за функции
}