#include <iostream>
using namespace std;
/* булева функция, която връща или true или false */
/* целта е да провери дали две числа са равни */
bool checkPass(int actualPass, int attemptedPass) {
	return (actualPass == attemptedPass);
}

/* тази функция е void - тя няма да връща стойности.
   нейната идея е да показва всичко в конзолата.
 
	без да влизаме в много подробности засега, 
	прочетете кода, опитайте се да осмислите какво всъщност
	става
	и после преминете надолу
 */

void loginProcess(int actualPass) {
	cout << "Input your password: ";
	int pass;
	cin >> pass;
	if (!checkPass(actualPass, pass)) { 
		cout << "Wrong password! Try again!" << endl << endl;
		loginProcess(actualPass);
	} else {
		cout << "Welcome!" << endl << endl;
	}

	/* ОБЯСНЕНИЕ (spoiler alert!!)
	   нали идеята на тази програма беше да върви
	   докато не се log-не потребителят? но ние нямаме
	   цикъл - как ще върви постоянно?

	   истината се крие в този ред:
	   'loginProcess(actualPass);'

	   това, което става е, че докато върви функцията loginProcess
	   ние можем пак да я повикаме, което ще доведе до повтаряне на всичко
	   което е станало до момента. Един вид си го представете по този начин(и то не е твърде далеч
	   от истината).

	   когато напишем loginProcess(actualPass), ние повикваме или, по-простичко, "пускаме" функцията
	   това го приемете за равносилно на това да намерим в нашия код мястото, където сме дефинирали функцията
	   и параметрите й и да заменим единственият и параметър с actualPass и да изпълним функцията.
	   т.е. намираме този ред в кода: void 'loginProcess(int actualPass) {' заменяме actualPass в дефиницията
	   със стойността на actualPass от реда 'loginProcess(actualPass)' и тогава изпълняваме всички изрази в
	   блока на функцията (който също се нарича тяло на функцията) един след друг, почвайки от първия точно след
	   лявата къдрава скоба '{':

	   void loginProcess(int actualPass) { -> от тук
	     alabala;
	     alabala
	     alabala;
	   } -> до тук е тялото на функцията.

	   Затова всеки път, когато се намираме на реда loginProcess(actualPass) (24-ти ред) ние пускаме
	   loginProcess функцията и отиваме директно на първия ред след '{' в дефиницията на функцията.
	   този първи ред се пада 19-ти ред в нашата програма, който е 'cout << "Input your password: ";'

	   По този начин можете с функции да имитирате while и for-ове. */
}

// тук само ще повикваме функцията
int main() {
	loginProcess(1234); // единственият аргумент на функцията "пази" това,
						// което ще смятаме за вярната парола
	return 0;
}