#include <iostream>
using namespace std;
int main() {

    int number = 5; // създаваме променлива. Тя получава адрес в паметта, който ние вмомента не можем да знаем
    int *pointer = &number; // създаваме указател към тази променлива, като го инициализираме със стойността - адрес на променливата

    *pointer += 1; // с оператора * , който в случая се нарича оператор за дереференциране (не диференциране), достъпваме стойността 
    			   // на променливата и я променяме.
    
    cout << number << endl;

    return 0;
}
