#include<iostream>
using namespace std;

int numberOfEvens(int arr[], int size) {
    int count = 0;
    for (int i = 0; i < size; i++) {
        /*
            1 в двоичен запис винаги е от сорта на 0001,
            т.е. няколко нулички и завършва на 1.

            => ако направим логическо побитово "и" (&),
               всички цифри на полученото число,
               освен последната със сигурност ще са 0.
               => резултатът ще е или 0 или 1. Ако е 0, значи
               на първоначалното число последната цифра е 0(в двоична бройна система)
               и значи се дели на 2. Ако е 1 => последната цифра е 1(в двоична бройна система) =>
               не се дели на 2.
        */
        if ((arr[i]&1)==0) {
            count++;
        }
    }
    return count;
}


int main() {
    int arr[] = {1, 3, 4, 6, 2};
    cout << numberOfEvens(arr, 5);

    return 0;
}
