#include <iostream>
using namespace std;

void recPrint(int n)
{
    if(n<=0) return; // дъното на рекурсията
                     // ако сме го стигнали
                     // просто спираме изпълнението
                     // без да печатаме нищо

    cout<<n<<endl; // ако не сме стигнали дъното
                   // печатаме текущото число

    recPrint(n-1); // и оставяме функцията да се погрижи за останалото,
                   // викайки я рекурсвино
}

int main() {

    recPrint(10);
    return 0;
}
