// Здравейте, аз съм Коментар. 
// Моята задача е да разяснявам
// неща, на хората, които четат кода.
// За нещастие обаче, компилаторът ме игнорира :(
// и затова в програмата аз не се изпълнявам. 
// Затова след тези символи '//' на същия ред
// мога да си кажа каквото #@!%, delete system32, поискам.
/*
	Понякога се простирам на няколко реда, защото
	мога. Всичко между тези две "огради" също не 
	играе никаква роля в програмата, освен за информация
	на този, който чете кода.
*/
int main() {}
/* 
	'int main()' е парче код, което
	ще виждате много често. Не ви трябват
	подробностите, но запомнете, че програмата
	почва от тук. Каквото и да стои над нея
	първата инструкция, която ще се изпълни 
	е първата след 'int main() {.. '. Опитайте
	се да живеете без него, но бързо ще разберете,
	че всяка програма (която представлява няколко файла
	с код на C++) трябва да има main функция някъде,
	и само веднъж в цялата програма. 

	ето го и шаблонът, който ще ползвате следващите няколко упражнения

	#include <iostream>
	using namespace std;

	int main() {
		... вашият код е тук ... 
		... вашият код е тук ... 
		... вашият код е тук ... 
		... вашият код е тук ... 
		... вашият код е тук ... 
		return 0;
	}

*/
